{"config": [{"config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_4", "filters": 32, "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "pool_size": [5, 5], "strides": [5, 5], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_5", "filters": 50, "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_5", "pool_size": [5, 5], "strides": [5, 5], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_6", "filters": 80, "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_6", "pool_size": [5, 5], "strides": [5, 5], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_3", "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_4", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_4", "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.0", "class_name": "Sequential"}